Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་ལྟ་བུའི་ཟབ་མོའི་གནས་ཐོས་ནས། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཟབ་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསོལ་ཏེ། དཔེ་ལ་ཡང་དེ་བཞིན་དུ་སྦྱར་བར་བྱའོ། །དཔེར་ན་མི་དེས། རྩ་བ་དང་། ཤུན་པ་དང་ཡལ་ག་དང་།
en: Explanation of Chapters 64 to 72 Having heard about such a deep state, he says, “Deep, Lord, is the perfection of wisdom,” and so on.

source: ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་འདོད་པར་གྱུར་ན། ཐོག་མར་དེ་དག་མི་དམིགས་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔས་ཀྱང་ཆོས་ཐམས་ཅད་མི་དམིགས་སོ།
en: Connect this with this simile as well: understand, as an illustration, that just as a person who wants roots, bark, leaves, flowers, and fruit does not, in the beginning, apprehend them, similarly a bodhisattva does not apprehend all dharmas.

source: །ཇི་ལྟར་ཕྱིས་མི་དེས་སྡོང་བུ་བསྐྱེད་ན། རྩ་བ་དང་ཤུན་པ་ལ་སོགས་པ་རྙེད་ནས་ཉེ་བར་སྤྱོད་པ་དེ་བཞིན་དུ། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་དུ་མ་བསྐྱེད་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་ཉེ་བར་སྤྱོད་པར་བྱེད་པར་ཤེས་པར་བྱའོ།
en: And just as the person gets and makes use of the roots, bark, and so on later when the trunk has grown, similarly all beings are given use of the benefits and happiness when the many accumulations of merit and knowledge have increased and they have gained the knowledge of all aspects. “

source: །རབ་འབྱོར་དེ་བཞིན་ཉིད་གང་གིས་དེ་བཞིན་གཤེགས་པར་གདགས་པ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དུ་གཤེགས་པས་ན་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ།
en: Subhūti, it is because that suchness, on account of which tathāgatas are labeled, is just the suchness… on account of which the suchness of all beings and the suchness of the tathāgatas is labeled.” The “tathāgatas” are so called because of having gone into reality.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་ཉིད་དུ་གཤེགས་པ་ཡིན་ཏེ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་བརྗོད་པར་བྱའོ།
en: Bodhisattvas, too, go into reality, therefore they should indeed be called tathāgatas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་ཉིད་འདི་ལ་གནས་ཏེ་ཞེས་བྱ་བ་འགྲེས་གཉིས་པ་ལ་དེ་བཞིན་ཉིད་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་སྟེ།
en: In the second subsection of the passage, “standing in this suchness, bodhisattva great beings,” because of comprehending and realizing suchness, “are called tathāgatas.”

source: དེ་བཞིན་ཉིད་འདི་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This reality is also called “the perfection of wisdom.”

source: །དེའི་འོག་ཏུ་དེ་བཞིན་ཉིད་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཕན་ཡོན་དང་བསོད་ནམས་འཕེལ་བ་ནི་གོ་སླའོ།
en: After this, the increase in benefits and merits from practicing suchness and the perfection of wisdom is easy to understand. “

source: །བྱང་ཆུབ་སེམས་དཔའ་ཞུགས་པར་གྱུར་པ་ཞེས་བྱ་བ་ནི་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ལམ་ལ་གནས་པའོ།
en: Candidates for bodhisattva” are those standing on the path to perfect, complete awakening. “

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་བ་ནི་དངོས་པོ་མེད་པས།
en: Subhūti… the knowledge of all aspects is a nonexistent thing that is without a defining mark,” and so on.

source: མཚན་ཉིད་མེད་པ་ཞེས་བྱ་བ་ནི་དངོས་པོའི་ཆོས་ལས་འདས་པའི་ཕྱིར་དངོས་པོ་མེད་པའོ། །རང་དང་སྤྱིའི་མཚན་ཉིད་དང་བྲལ་བའི་ཕྱིར་མཚན་ཉིད་མེད་པའོ། །མིང་དང་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བའི་ཕྱིར་མཚན་མ་མེད་པའོ། །རྩོལ་བ་མེད་པའི་ཕྱིར་ལྷུན་གྱིས་གྲུབ་པའོ། །འདུས་མ་བྱས་པའི་ཕྱིར་སྐྱེ་བ་མེད་པའོ།
en: It is “a nonexistent thing” because it is beyond existent dharmas; “without a defining mark” because it is separated from specific and general defining marks; “without a causal sign” because it is separated from all words and signifiers; “without effort” because it is spontaneous; “unproduced” because it is uncompounded; “and not appearing” because it is marked as not remaining. “

source: །གནས་པ་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་འབྱུང་བ་མེད་པའོ། །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དངོས་པོ་མེད་པ་ལ་དམིགས་པའོ་ཞེས་བྱ་བ་ནི་དངོས་པོ་མེད་པ་ལས་བརྩམས་ནས་འཇུག་ཅེས་བྱ་བའི་ཐ་ཚིག་སྟེ། དམིགས་པའི་རྐྱེན་ནི་མ་ཡིན་ནོ།
en: Subhūti, the objective support of the knowledge of all aspects is a nonexistent thing” means “it operates having taken a nonexistent thing as the point of departure”; it is not the objective support condition. “

source: །དྲན་པས་དབང་བསྒྱུར་བ་ཞེས་བྱ་བ་ནི་སྔོན་གྱི་རྒྱུའི་དབང་གིས་བརྗོད་ཀྱི་དེའི་ཚེ་ནི་མ་ཡིན་ནོ།
en: The dominant factor is mindfulness.” It says that based on its being its earlier cause. It is not there at that time. “

source: །རབ་འབྱོར་འདུས་པ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་ཅེས་བྱ་བ་ནི་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་དེ། རྐྱེན་གཞན་གྱི་དབང་ལས་བྱུང་བའི་ཕྱིར་འདུས་པ་ལས་བྱུང་ཞེས་བྱ་སྟེ།
en: Subhūti, something that has arisen from a union has no intrinsic nature…” Form, feeling, and so on, which are imaginary in their intrinsic nature, are said to be “arisen from a union” because they have arisen dependent on conditions.

source: གཞན་གྱི་དབང་བྱ་བའི་ཕྱིར་དེ་ལྟ་བུའི་ངོ་བོ་ཉིད་ཀྱི་མིང་དུ་འགྱུར་རོ།
en: Such an intrinsic nature is a nominal one because it is necessarily dependent. “

source: །གང་ལ་འདུས་པ་ལས་བྱུང་བའི་ངོ་བོ་ཉིད་མེད་པ་སྟེ་དངོས་པོ་མེད་པའོ་ཞེས་བྱ་བ་ནི་ཆོས་གང་གཞན་ལ་རག་ལས་པ་ཡིན་གྱི།
en: And anything arisen from a union with no intrinsic nature is a nonexistent thing.” A dharma that is contingent on something else—that is not an “intrinsic nature”—is called a “nonexistent thing.”

source: ངོ་བོ་ཉིད་ཅེས་བྱ་བ་མ་ཡིན་པ་དེ་དངོས་པོ་མེད་པ་ཞེས་ཏེ། རི་བོང་གི་རྭ་ལ་སོགས་པ་ལྟར་གཏན་མེད་པའི་ཕྱིར་མེད་པ་ནི་མ་ཡིན་གྱི་དངོས་པོ་ཡོད་པའི་ཆོས་ལས་བཟློག་པའི་ཕྱིར་དངོས་པོ་མེད་པའོ།
en: It is not nonexistent because it is absolutely nonexistent like a rabbit’s horns and so on; it is because it is the nonexistent thing that is the reverse of a phenomenon that is an existent thing. “

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཅེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་ལ་དངོས་པོ་མེད་པ་ཞེས་བྱའོ།
en: Are the intrinsic nature of a nonexistent thing”— falsely imagined dharmas, form and so on, are called “nonexistent things.”

source: །དེ་ལ་བཟློག་པའི་ངོ་བོ་ཉིད་ཀྱང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཅེས་བྱའོ།
en: The reversed intrinsic nature they have is also called “the intrinsic nature of a nonexistent thing.”

source: །དེའི་འོག་ཏུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པ་དང་ཐབས་མཁས་པ་དག་བསྟན་ཏོ།
en: After that it teaches that the perfection of wisdom is the nonexistence of an intrinsic nature and is skillful means.

source: །དེ་ལ་བཅོམ་ལྡན་འདས་ཆོས་རྣམས་ཆོས་ཉིད་དང་བྲལ་བ་ལགས་སམ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་དང་བྲལ་བ་ཡིན་ན་དེ་ལྟ་ན་ནི་ཤེས་པར་བྱ་བ་དང་ཤེས་པར་བྱེད་པ་ཡང་མེད་པས་འདི་ནི་ཤེས་པར་བྱས་སོ་ཞེས་བྱ་བར་བརྗོད་དུ་མི་རུང་ངོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There, “Lord, are phenomena separated from the phenomena themselves?” means that if all phenomena are separated from all phenomena, in that case something known and something that knows would not exist, and it would not be suitable to say, “It is known.” “

source: །དངོས་པོས་ཀྱང་དངོས་པོ་འཚལ་བར་མི་རུང་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པས་ཀུན་བརྟགས་པ་ཤེས་པར་མི་རུང་སྟེ།
en: It is not appropriate that an existent thing knows an existent thing.”

source: མེད་པའི་ཕྱིར་ཇི་ལྟར་སྒྱུ་མའི་གླང་པོ་ཆེས་སྒྱུ་མའི་གླང་པོ་ཆེའི་རྗེས་ལྟ་བུའོ།
en: It is not appropriate that a falsely imagined phenomenon knows a falsely imagined phenomenon, like an illusory elephant a footprint of an illusory elephant. “

source: །དངོས་པོ་མེད་པས་ཀྱང་དངོས་པོ་མེད་པ་ཤེས་པར་མི་རུང་སྟེ། ཇི་ལྟར་ནམ་མཁས་ནམ་མཁའ་ལྟ་བུའོ། །དངོས་པོས་ཀྱང་དངོས་པོ་མེད་པ་ཤེས་པར་མི་རུང་སྟེ། ཇི་ལྟར་སྒྱུ་མའི་མིས་ནམ་མཁའ་ལྟ་བུའོ། །དངོས་པོ་མེད་པས་ཀྱང་དངོས་པོ་ཤེས་པར་མི་རུང་སྟེ།
en: It is not appropriate that a nonexistent thing knows a nonexistent thing,” like space; “it is not appropriate that an existent thing knows a nonexistent thing,” like an illusory person space; and “it is not appropriate that a nonexistent thing knows an existent thing,” like space an illusory person.

source: ཇི་ལྟར་ནམ་མཁས་སྒྱུ་མའི་མི་བཞིན་ཏེ་འདི་ནི་དངོས་པོ་ཡོད་པ་དང་དངོས་པོ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: This is the perfection of wisdom of existent things and nonexistent things. “

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱང་གཞན་ཞིག་ལ།
en: Lord, is ordinary convention one thing and the ultimate another?”

source: དོན་དམ་པ་ཡང་གཞན་ལགས་སམ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་དངོས་པོ་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར་དོན་དམ་པ་ཞུས་པའོ།
en: An ordinary convention is marked as a nonexistent thing, so the question is about the ultimate. “

source: །འཇིག་རྟེན་ཀུན་རྫོབ་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་དོན་དམ་པའི་དེ་བཞིན་ཉིད་ཡིན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཅེས་བྱ་བ་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་དོན་དམ་པའི་དེ་བཞིན་ཉིད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Just that suchness of ordinary convention is the suchness of the ultimate” means that the suchness of “ordinary convention”—of all dharmas, form and so on—is itself just the suchness of the ultimate. “

source: །རབ་འབྱོར་ཡང་དག་པའི་དོན་ནི་སངས་རྒྱས་ཞེས་བྱ་སྟེ་ཞེས་བྱ་བ་ནི་སངས་རྒྱས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་གསུངས་པ་སྟེ་ཡང་དག་པའི་དོན་དེ་བཞིན་ཉིད་ཆོས་ཀྱི་སྐུ་ལ་སངས་རྒྱས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Subhūti, true reality is called buddha” says what the intrinsic nature marking an awakened being is. It means true reality, suchness, the dharma body, is called buddha. “

source: །དེས་ཡང་དག་པའི་དོན་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་ཞེས་བྱ་བ་ལ་སོགས་པ་རྣམ་པ་གསུམ་གྱིས་ངེས་པའི་ཚིག་གསུངས་པ་སྟེ།
en: Also, they are those who have fully awakened to the true Dharma, therefore they are called buddha,” and so on, provides three creative explanations.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ནི་དགྲ་བཅོམ་པའི་ལམ་གྱི་ཡེ་ཤེས་ཀྱིས་ཡང་དག་པའི་ཆོས་མྱ་ངན་ལས་འདས་པ་ཉིད་སངས་རྒྱས་པར་འགྱུར་བ་དང་། དེའི་འོག་ཏུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་ཡང་དག་པའི་དོན་སྟོང་པ་དང་ཞི་བ་ལ་སོགས་པའི་དོན་དུ་རྟོགས་པ་དང་། དེའི་རྗེས་ལ་ཐོབ་པ་དང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་པའི་ཡེ་ཤེས་ཀྱིས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་རྟོགས་པར་འགྱུར་ཏེ།
en: With the knowledge of a worthy one’s path, the lords awaken to the true Dharma—the state of nirvāṇa; then, with the knowledge of a knower of all aspects they have a penetrating realization of true reality as a reality that is empty, calm, and so on; and with the subsequent attainment of the knowledge of those who know all, they subsequently realize the characteristic marks of all.

source: དེ་ལྟར་ཡང་དག་པའི་ཆོས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཡང་དག་པའི་དོན་རབ་ཏུ་རྟོགས་པ་དང་། ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཕྱིར་སངས་རྒྱས་ཞེས་བྱའོ།
en: Thus, it says, because “there are those who have fully awakened to the true Dharma… have a penetrating realization of true reality, … [and] have fully awakened to all dharmas as they really are, therefore they are called buddha.” “

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཅེས་བགྱི་བ་དེ་གང་གི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ལགས་སོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཀྱང་རྣམ་པ་གསུམ་དུ་བསྟན་ཏེ་ངོ་བོ་ཉིད་དང་མཚན་ཉིད་དང་ངེས་པའི་ཚིག་གིས་སོ།
en: Lord, what is the word awakening for?” Awakening is also taught threefold: intrinsic nature, characteristic mark, and creative explanation.

source: །དེ་ལ་ངོ་བོ་ཉིད་རྣམ་པ་གཉིས་ཏེ། ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་དང་། ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་དོ།
en: The intrinsic nature is twofold: the thoroughly established intrinsic nature and the falsely imagined intrinsic nature.

source: །དེ་ལ་ཡོངས་སུ་གྲུབ་པའི་ངོ་བོ་ཉིད་ནི་རབ་འབྱོར་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སོ་ཞེས་གསུངས་པའོ། །ཀུན་བརྟགས་པའི་ངོ་བོ་ཉིད་ནི་རབ་འབྱོར་འདི་ལྟར་ཡང་།
en: In regard to the thoroughly established intrinsic nature, it says, “Subhūti, awakening is a word for emptiness.”

source: བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་ནི་མིང་ཙམ་ཞེས་གསུངས་པའོ།
en: In regard to the falsely imagined intrinsic nature, it says, “Also, Subhūti, awakening is a word for mere designation.”

source: །མཚན་ཉིད་ནི་ཡང་དག་པའི་དོན་ནི་བྱང་ཆུབ་ཀྱི་དོན་ཏོ་ཞེས་གསུངས་པ་སྟེ།
en: As for the characteristic mark, it says “true reality means awakening.”

source: དོན་དམ་པའི་མཚན་ཉིད་ནི་ཡང་དག་པར་དོན་དམ་པའི་དོན་ཞེས་བྱའོ།
en: The characteristic mark of the ultimate is true reality, called the reality of the ultimate.

source: །ངེས་པའི་ཚིག་ནི་དེ་ནི་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་རྟོགས་པར་བྱེད་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་རྣམ་པ་གསུམ་སྟེ།
en: As for the creative explanation, it is threefold: “that awakening is a realization that all dharmas are a mere designation and causal sign,” and so on.

source: དེ་ལ་ཀུན་བརྟགས་པའི་མཚན་ཉིད་རྟོགས་པའི་ངེས་པའི་ཚིག་ནི་དེ་ནི་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མ་ཙམ་དུ་རྟོག་པར་བྱེད་པ་ཞེས་གསུངས་པའོ།
en: There, the creative explanation of it as the realization of the marks of falsely imagined phenomena is: “it is a realization that all dharmas are a mere designation and causal sign.”

source: །གཞན་གྱི་དབང་རྟོགས་པས། གནས་གྱུར་པའི་མཚན་ཉིད་ཆོས་ཀྱི་སྐུའི་ཚུལ་ནི་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་སྟེ། དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ་ཞེས་གསུངས་པའོ།
en: It says about the dharma body’s way of being marked by the transformation of the basis on account of the realization of dependent phenomena, “that… is the awakening of the lord buddhas, therefore it is called awakening.”

source: །ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་རྟོགས་པ་ནི་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ན་དེའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱའོ་ཞེས་གསུངས་པའོ།
en: As for the realization of the mark of the thoroughly established phenomenon, it says “the lord buddhas have fully awakened to it, therefore it is called awakening.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་ནི་ཆོས་གང་ཡང་བསྩགས་པའི་ཕྱིར་རམ།
en: In regard to the awakening of those practicing the perfection of wisdom, it says it “is not to accumulate or to diminish… any dharma.”

source: འགྲིབ་པར་བྱ་བའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སྦྱིན་པ་ལ་སོགས་པའི་དགེ་བའི་རྩ་བ་རྣམས་བསྩགས་པའི་ཕྱིར་རམ། སེར་སྣ་དང་འཆལ་པའི་ཚུལ་ཁྲིམས་ལ་སོགས་པ་འགྲིབ་པར་བྱ་བའི་ཕྱིར་རམ། ནག་པོའི་ཕྱོགས་རྣམས་ཉམས་པར་བྱ་བའི་ཕྱིར་རམ། དཀར་པོའི་ཕྱོགས་རྣམས་འཕེལ་བར་བྱ་བའི་ཕྱིར་རམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པར་བྱ་བའི་ཕྱིར་རམ། ཀུན་ནས་ཉོན་མོངས་པ་སྐྱེས་པ་རྣམས་དགག་པའི་ཕྱིར་རམ། དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ཀུན་ནས་ཉོན་མོངས་པར་བྱ་བའི་ཕྱིར་རམ། དྲི་མ་མེད་པའི་གནས་སྐབས་ན་རྣམ་པར་བྱང་བར་བྱ་བའི་ཕྱིར་དམིགས་པའི་ཚུལ་གྱིས་ཉེ་བར་གནས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ། བྱང་ཆུབ་ནི་དམིགས་པ་ཐམས་ཅད་སེལ་བའི་རང་བཞིན་ཡིན་པའི་ཕྱིར་དེ་སྐད་ཅེས་གསུངས་སོ།
en: Where it says “it is not available in the manner of an objective support that has to be accumulated,” wholesome roots from giving and so on; “or that has to be diminished,” miserliness, immorality and so on; “or that has to be decreased,” the dark side; “or that has to be increased,” the bright side; “or that has to be produced,” the unproduced buddhadharmas; “or that has to be stopped,” defilements that have been produced; “or that has to be defiled,” during the period with stains; “or that has to be purified,” during the period without stains, it says that because awakening is in its basic nature the elimination of all objective supports. “

source: །གཉིས་ཀྱི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅེས་བྱ་བ་ནི་དམིགས་པར་བྱ་བ་དང་དམིགས་པར་བྱེད་པའི་དངོས་པོས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Practice the perfection of giving in a dualistic way” means with apprehended and apprehender as existent things.

source: །དེ་ལྟར་དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་ཞེས་བྱ་བ་ནི་དམིགས་པའི་དབང་གིས་ཐབས་མཁས་པ་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་དེ་མ་ཐག་ཏུ་འོག་ནས་འཆད་དོ།
en: As it will say immediately after this below, “even bodhisattva great beings who have attended on the lord buddhas, have planted wholesome roots, and have been looked after by spiritual friends will not be able to gain the knowledge of all aspects,” because, on account of the power of apprehending things, they do not have skillful means. “

source: །ཇི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ལ་དམིགས་ནས་སྦྱིན་པ་བྱིན་ན་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་དུ་འགྱུར་རོ་སྙམ་ནས་གསོལ་པའོ།
en: How will… [they] fully grasp the perfection of giving?” He asks this with the thought that “giving gifts, having taken awakening as the object, is labeled the perfection of giving.” “[

source: །གཉིས་ཀྱི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ་ཞེས་བྱ་བ་ནི་འདི་བྱང་ཆུབ་ཀྱི་ཕྱིར་བྱའོ་ཞེས་དམིགས་པར་བྱ་བ་དང་དམིགས་པར་བྱེད་པ་གཉིས་ཀྱི་དངོས་པོར་རྣམ་པར་བརྟགས་ནས་མི་སྤྱོད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They] do not practice the perfection of giving in a dualistic way” means they do not practice with the idea, “I will do this for awakening,” conceptualizing the two—an apprehended and an apprehender—as existent things. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་གཉིས་ཀྱི་ཚུལ་གྱིས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མི་སྤྱོད་ན་ཞེས་བྱ་བ་ནི་གལ་ཏེ་གཉིས་ཀྱི་ཚུལ་གྱིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྔོ་ཞིང་མི་བྱེད་ན་ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་མངོན་པར་འཕེལ་བར་འགྱུར་ཞེས་ཞུས་པའོ།
en: Lord, if they do not practice the perfection of giving in a dualistic way” is asking: if they are not making a dedication to awakening in a dualistic way, how will the wholesome roots grow and flourish? “

source: །རབ་འབྱོར་གང་གཉིས་ལ་སྤྱོད་པ་དེ་དག་ནི་དགེ་བའི་ཆོས་རྣམས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གཉིས་སུ་མེད་པར་སྤྱོད་པ་ཉིད་དགེ་བའི་རྩ་བ་འཕེལ་བའི་རྒྱུ་ཡིན་གྱི་གཉིས་སུ་སྤྱོད་པ་ནི་མ་ཡིན་ནོ་ཞེས་བསྟན་པ་སྟེ།
en: Subhūti, those who practice dualistically do not grow and flourish on wholesome roots” teaches that just practicing without dualism causes the wholesome roots to grow and flourish, not dualistic practice.

source: འདི་ནི་གཉིས་སུ་མེད་པར་སྤྱོད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: This is the practice of the perfection of wisdom without dualism.

source: །དེ་ནས་ཡང་ཐབས་མཁས་པས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ལ་སྤྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པའི་ངོ་བོ་ཉིད་ལས་མི་གཡོ་བ་རྣམས་ནི་གཞུང་ཉིད་ལས་གོ་སླའོ།
en: Then the practice of the six perfections endowed with skillful means, the practice of the dharmas on the side of awakening, the practice of the buddhadharmas, and the praise of the bodhisattvas who “do not move from their intrinsic nature” are easy to understand from the scripture itself.

source: །དངོས་པོ་མ་མཆིས་པས་དངོས་པོ་མ་མཆིས་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བགྱི་བར་ནུས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པ་རྣམ་པར་རྟོག་པ་བཞི་ནི་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ལ་དེ་ལྟ་བུའི་རྣམ་པར་རྟོག་པས་སྤྲོར་རུང་བ་མ་ཡིན་པའི་ཕྱིར་འདི་ལ་ཤེས་པར་བྱེད་པ་མེད་དོ།
en: As for the four possibilities in “can a nonexistent thing fully awaken to a nonexistent thing,” and so on, it is not suitable to connect full awakening with those sorts of four possibilities so a scriptural authority for them does not exist. “

source: །ཇི་ལྟར་དངོས་པོ་དང་དངོས་པོ་མེད་པ་ཡང་མ་ཡིན་པ་དེ་ལྟར་མཉམ་པ་ཉིད་མཐོང་བ་ནི་མངོན་པར་རྟོགས་པ་ཞེས་བྱ་བ་ནི་སྒྱུ་མ་བྱས་པ་བཞིན་ཏེ་ཀུན་བརྟགས་པ་ནི་དངོས་པོའི་རྣམ་པ་མ་ཡིན་ལ་རི་བོང་གི་རྭ་ལྟར་ཤིན་ཏུ་མེད་པའི་རྣམ་པ་ཡང་མ་ཡིན་ནོ།
en: Seeing sameness like this, not like an existent thing and not like a nonexistent thing either, is clear realization.” A falsely imagined phenomenon, like something conjured up by magic, is not in the form of an existent thing nor in a totally nonexistent form like a rabbit’s horns.

source: །དངོས་པོ་དང་དངོས་པོ་མེད་པ་མཉམ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་དང་དངོས་པོ་མེད་པ་མཉམ་པ་ཉིད་མཐོང་བ་མངོན་པར་རྟོགས་པ་ཞེས་བྱ་སྟེ། འདི་ནི་སྤྲོས་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: That sameness that is not an existent thing and not a nonexistent thing is seeing, “is clear realization” of the sameness of an existent thing and nonexistent thing— “the perfection of wisdom without thought construction.” “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། དགྲ་བཅོམ་པས་ལམ་ཐམས་ཅད་ལ་བསླབས་ནས་ཞེས་བྱ་བ་ནི་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པའི་ལམ་ལ་བསླབས་ནས་སོ། །ཡང་དག་པ་ཉིད་སྐྱོན་མེད་པ་ལ་འཇུག་སྟེ་ཞེས་བྱ་བ་ནི་དགྲ་བཅོམ་པ་ཉིད་ཀྱི་སྐྱོན་མེད་པ་འཇུག་པའོ།
en: To illustrate, Subhūti, worthy ones… having trained on all the paths”— having trained on the paths of stream enterer, once-returner, non-returner, and worthy one— “do indeed enter into the flawlessness that is a perfect state,” do enter into a worthy one’s state of flawlessness.

source: །རེ་ཞིག་ལམ་གྱི་སྐད་ཅིག་ལ་དགྲ་བཅོམ་པའི་ལམ་གྱི་འབྲས་བུ་མ་ཐོབ་ཀྱི་བར་དུ་ཞེས་བྱ་བ་ནི་ཇི་སྲིད་དུ་ཐ་མ་ལ་རྣམ་པར་གྲོལ་བའི་ལམ་གྱི་སྐད་ཅིག་མི་སྐྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: For the moment, they “will not reach the result of worthy one in a single instant of the path” means for as long as they have not finally produced the moment of the path of freedom. “

source: །སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་ཞེས་བྱ་བ་ནི་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་སྐད་ཅིག་དང་ལྡན་པས་སོ།
en: Through the wisdom of the unique single instant”— through the instant of “the vajropama meditative stabilization.” “

source: །ཤེས་པ་དང་མཐོང་བས་ས་བརྒྱད་པོ་དག་ལ་རྣམ་པར་བལྟས་ནས་ཡོངས་སུ་འདའ་སྟེ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་དྲིས་པའི་ཤེས་པ་བསྟན་པའི་སྐབས་སུ་སྔར་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་ནོ།
en: Having beheld all eight levels, pass beyond them with knowledge and seeing,” just as explained earlier in the section teaching knowledge of mastery. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྐད་དང་བརྡ་དང་སྒྲ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པར་བྱ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་སྣ་ཚོགས་ཀྱི་སྐད་དང་མཐུན་པར་རོ།
en: On that bodhisattva great beings should accomplish vocalizations, conventional terms, and sounds,” similar to the vocalizations of the various beings. “

source: །ཆོས་གང་ལ་ཡང་སྒྲུབ་པའམ། འཇིག་པར་བགྱིད་པ་མ་མཆིས་སོ་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་མཚན་ཉིད་མེད་པ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ་དག་བྱང་ཆུབ་སྒྲུབ་པ་མ་ལགས་སམ་ཞེས་ཞུས་པ་དང་།
en: Do not bring about and do not take away any dharma at all”— he asks: those dharmas on the side of awakening with no characteristic mark, the nonexistence of an intrinsic nature, do not bring about awakening, do they?

source: བཅོམ་ལྡན་འདས་ཀྱིས་རབ་འབྱོར་དེ་དེ་བཞིན་ནོ་དེ་དེ་བཞིན་ཏེ་ཞེས་བསྔགས་པ་མཛད་དེ།
en: And the Lord raises his voice in praise, with “exactly so, Subhūti, exactly so!”

source: ཆོས་གང་ཡང་ཆོས་གང་ལ་ཡང་སྒྲུབ་པར་མི་བྱེད་དེ། ཆོས་རྣམས་གནས་པའི་མཚན་ཉིད་ཀྱི་ཕྱིར་རོ།
en: Nothing at all brings about anything at all, because dharmas are marked by remaining the same.

source: དེ་ལྟ་མོད་ཀྱི་བྱིས་པ་རྣམས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཐབས་སུ་ཀུན་རྫོབ་ཏུ་འདི་མཛད་དེ། རིམ་པ་འདིས་ཤེས་པར་གྱུར་ནས་དེ་བཞིན་དུ་བསྒྲུབས་པས་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Still, even though that is the case, it formulates this conventionally, as a method so that simple folk will comprehend, because having understood in this gradual sequence and practiced like that, they become awakened. “

source: །འཕགས་པའི་ཆོས་འདུལ་བ་ཞེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་ཀྱིས་འདོད་ཆགས་ལ་སོགས་པ་འདུལ་བ་དང་། བསྒྲུབས་པས་འདུལ་བར་གནས་པའི་མཚན་ཉིད་དུ་སྟོན་ཏོ།
en: Noble Dharma and Vinaya” teaches that in its intrinsic nature it tames attachment and so on, and, when it has been achieved, is marked by remaining tamed.

source: །འཕགས་པའི་ཆོས་འདུལ་བ་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའོ།
en: This “noble Dharma and Vinaya” is the “perfection of wisdom.” “

source: །འདི་ནི་ཆོས་ཐམས་ཅད་སྒོམ་པ་རྣམ་པར་འཇིག་པའོ་ཞེས་བྱ་བ་ནི། གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་སྒོམ་པ་མེད་པར་བྱེད་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The disintegration of meditation on all dharmas is meditation” means meditating on “all dharmas,” form and so on, as nonexistent things. “[

source: །གཟུགས་དངོས་པོ་ཡོད་ཅེས་བྱ་བར་མི་སྒོམ་མོ་ཞེས་བྱ་བ་ནི་གཟུགས་དངོས་པོ་ཡོད་པའི་ངོ་བོ་ཉིད་དོ་སྙམ་དུ་མི་སྒོམ་པ་དེ་ནི་དངོས་པོ་ལ་འདི་ནི་བདག་གོ་ཞེས་བྱ་བར་མཐའ་གཉིས་ལ་ཆགས་ཏེ་ཞེས་བྱ་བ་ནི་དངོས་པོའི་འདུ་ཤེས་ཅན་ཏེ།
en: They] do not meditate on ‘form is an existent thing’ ” means they do not meditate on “form is an existent thing in its intrinsic nature.” “

source: འདི་ནི་བདག་སྟེ་གུད་ན་ཡོད་དོ་ཞེའམ། བདག་ནི་གཟུགས་སོ། །བདག་ནི་ཚོར་བའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཆད་པ་དང་། རྟག་པའི་མཐའ་གཉིས་ལ་ཆགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Someone attached to the two extremes, thinking ‘this is me,’ in reference to an existent thing”— this means someone attached to the two extremes of permanence and annihilation with the notion of an existent thing: “This is me, which is to say, I exist separately,” “I am form,” “I am feeling,” and so on. “

source: །རབ་འབྱོར་གཟུགས་སུ་འདུ་ཤེས་པ་ནི་གཉིས་སོ་ཞེས་བྱ་བ་ནི་གང་ལ་གཟུགས་སོ་ཞེས་བྱ་བའི་འདུ་ཤེས་ཡོད་པ་དེ་ལ།
en: Subhūti, the perception of form is a duality.”
